apps/sefaz-mock/wsdl/nfestatusservico4.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="NFeStatusServicoService"
  targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico"
  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
  xmlns:tns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico"
  xmlns:nfe="http://www.portalfiscal.inf.br/nfe"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
>

  <wsdl:types>
    <xsd:schema targetNamespace="http://www.portalfiscal.inf.br/nfe">
      <xsd:import namespace="http://www.portalfiscal.inf.br/nfe"
        schemaLocation="../xsd/consStatServ_v4.00.xsd" />
      <xsd:import namespace="http://www.portalfiscal.inf.br/nfe"
        schemaLocation="../xsd/retConsStatServ_v4.00.xsd" />
    </xsd:schema>
  </wsdl:types>

  <wsdl:message name="nfeStatusServicoNFRequest">
    <wsdl:part name="nfeDadosMsg" element="nfe:consStatServ" />
  </wsdl:message>
  <wsdl:message name="nfeStatusServicoNFResponse">
    <wsdl:part name="nfeResultMsg" element="nfe:retConsStatServ" />
  </wsdl:message>

  <wsdl:portType name="NFeStatusServicoPortType">
    <wsdl:operation name="nfeStatusServicoNF">
      <wsdl:input message="tns:nfeStatusServicoNFRequest" />
      <wsdl:output message="tns:nfeStatusServicoNFResponse" />
    </wsdl:operation>
  </wsdl:portType>

  <wsdl:binding name="NFeStatusServicoSoapBinding" type="tns:NFeStatusServicoPortType">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="nfeStatusServicoNF">
      <soap:operation
        soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico/nfeStatusServicoNF" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>

  <wsdl:service name="NFeStatusServicoService">
    <wsdl:port name="NFeStatusServicoPort" binding="tns:NFeStatusServicoSoapBinding">
      <soap:address location="https://localhost:3000/ws/nfestatusservico4" />
    </wsdl:port>
  </wsdl:service>

</wsdl:definitions>
